In [1]:
# Dependencies
import numpy as np
import datetime as dt
import pandas as pd

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [2]:
engine = create_engine("sqlite:///hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

In [3]:
# Create our session (link) from Python to the DB
session = Session(engine)

## D1: Determine the Summary Statistics for June

In [4]:
# 1. Import the sqlalchemy extract function.
from sqlalchemy import extract

# 2. Write a query that filters the Measurement table to retrieve the temperatures for the month of June. 
# create empty list and write query to access data
results = []
results = session.query(Measurement.date, Measurement.tobs).all()

In [5]:
#  3. Convert the June temperatures to a list.
# above?

In [6]:
# 4. Create a DataFrame from the list of temperatures for the month of June. 
# not just june
df = pd.DataFrame(results)
df.sample(5)

             date  tobs
19014  2016-01-30  67.0
19530  2017-08-03  76.0
9380   2012-03-01  71.0
14934  2017-07-16  80.0
13574  2013-10-24  71.0

In [7]:
# convert date column to datetime
df['date'] = pd.to_datetime(df['date'])
# filter df by month == june
df = df[df['date'].dt.month == 6]
df.sample(5)

            date  tobs
134   2010-06-02  76.0
9118  2010-06-11  77.0
9681  2010-06-15  75.0
7668  2010-06-23  77.0
15480 2011-06-22  71.0

In [8]:
# 5. Calculate and print out the summary statistics for the June temperature DataFrame.
df.describe()

              tobs
count  1700.000000
mean     74.944118
std       3.257417
min      64.000000
25%      73.000000
50%      75.000000
75%      77.000000
max      85.000000

## D2: Determine the Summary Statistics for December

In [9]:
# 6. Write a query that filters the Measurement table to retrieve the temperatures for the month of December.
results = []
results = session.query(Measurement.date, Measurement.tobs).all()

In [10]:
# 7. Convert the December temperatures to a list.
# above?

In [11]:
# 8. Create a DataFrame from the list of temperatures for the month of December. 
df = pd.DataFrame(results)
df.sample(5)

             date  tobs
19438  2017-04-27  76.0
7679   2010-07-09  73.0
13368  2013-04-01  68.0
16145  2013-04-25  68.0
6984   2015-07-15  80.0

In [12]:
# convert date column to datetime
df['date'] = pd.to_datetime(df['date'])
# filter df by month == june
df = df[df['date'].dt.month == 12]
df.sample(5)

            date  tobs
6523  2013-12-11  75.0
5219  2016-12-30  69.0
17970 2012-12-26  69.0
16380 2013-12-17  63.0
10576 2012-12-01  77.0

In [13]:
# 9. Calculate and print out the summary statistics for the Decemeber temperature DataFrame.
df.describe()

              tobs
count  1517.000000
mean     71.041529
std       3.745920
min      56.000000
25%      69.000000
50%      71.000000
75%      74.000000
max      83.000000